//Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// Console.Write("Вести номер дня недели: ");
// int dayNum = Convert.ToInt32(Console.ReadLine());

// void DeyNed (int dayNum) 
// {
//   if (dayNum == 6) 
//   {
//     Console.WriteLine("выходной");
//   }
//   if (dayNum == 7) 
//   {
//     Console.WriteLine("выходной");
//   }
//   else if (dayNum < 1)
//   {
//     Console.WriteLine("не день недели");
//   }
//   else if (dayNum > 7) 
//   {
//     Console.WriteLine("не день недели");
//   }
//   else Console.WriteLine("будни");
// }

// DeyNed(dayNum);

//не нашел что-то варианта как можно сразу прописать оба равенства в строку под одним if.


// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// Console.Write("напишите число от двух символов второй символ: ");
// int threeDigitNumber = Convert.ToInt32(Console.ReadLine());
// string stringNumber = Convert.ToString(threeDigitNumber);
// Console.WriteLine("второй символ: "+stringNumber[1]);



// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// Console.Write("любое цисло получите третьй символ: ");
// Double Num = Convert.ToDouble(Console.ReadLine());
// string Numb = Convert.ToString(Num);
// if (Numb.Length > 2)
// {
//   Console.WriteLine("третий символ:" + Numb[3]);
// }
// else 
// {
//   Console.WriteLine("символа нет");
// }

